import './index.scss'

const Roll =()=>{
    return(
        <div className="roll">
            <div className="cont ro">
                <h1>شروط الموقع</h1>
                <div className="box">
                    <h3>الخدمه</h3>
                    <p>
                        يبحث الكثير من الأفراد على شركة ايجار سيارات ، ولكنها تكون بأسعار مرتفعة، بضمانات مالية ضخمة، ولكن الآن لا داعي للبحث كثيراً شركتنا تُقدم لكم احدث السيارات بأرخص الأسعار وسهولة التعامل
                    </p>
                </div>
                <div className="box">
                    <h3>مده الاستئجار</h3>
                    <p>
                        يومية أو شهرية أو سنوية
                    </p>
                </div>
                <div className="box">
                    <h3>رسوم الاستئجار</h3>
                    <p>
                        تختلف  رسوم الاستئجار، سواء كانت رسوم يومية أو شهرية أو سنوية
                    </p>
                </div>
                <div className="box">
                    <h3>شروط الدفع</h3>
                    <p>
                        عن طريق البطاقة الائتمانية أو التحويل البنكي. أو عند استلام السيارة من المندوب
                    </p>
                </div>
                <div className="box">
                    <h3>مكان الاستلام والتسليم</h3>
                    <p>
                        سيتم إرسال السيارة المطلوبة اليك مع مندوب خاص وسيتم تسليم السيارة في المكان الذي سيحدده لك فريق العمل
                    </p>
                </div>
                <div className="box">
                    <h3>حالة السيارة</h3>
                    <p>
                        سيتم الكشف عن السيارة قبل الاستلام ويجب أن تكون حالة السيارة عند التسليم، سليمة مثلما سلمت  وليس بها اي ضرر ملحوق  والا سوف يتم اتخاذ  الأمر القانوني
                    </p>
                </div>
                <div className="box">
                    <h3>الاستخدام المسموح به</h3>
                    <p>
                        سيتم معرفتك ب  الاستخدام المسموح به للسيارة، سواء كان استخدامها للرحلات الشخصية أو للرحلات التجارية
                    </p>
                </div>
                <div className="box">
                    <h3>لتأمين</h3>
                    <p>
                        لعقد التأمين الذي يغطي السيارة، سواء كان تأمين ضد الحوادث أو تأمين ضد السرقة
                    </p>
                </div>
                <div className="box">
                    <h3>المسؤولية</h3>
                    <p>
                        ستكون في مسؤولية قانونية  في حالة حدوث حادث أو ضرر للسيارة
                    </p>
                </div>
            </div>
        </div>
    )
}
export default Roll;